; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v8 - type_2 ?v7 - type_3)
 	      (pred_4 ?v3 - object ?v7 - type_3)
	      (pred_2 ?v8 - type_2 ?v1 - type_1)
	      (pred_3 ?v8 - type_2 ?v3 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v8 - type_2 ?v2 ?v5 - type_3)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v5)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_3
       :parameters (?v8 - type_2 ?v4 - object ?v6 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v6) (pred_1 ?v8 ?v6) (pred_2 ?v8 ?v1))
       :effect (and (pred_3 ?v8 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v6)) 
		    (not (pred_2 ?v8 ?v1))))

   (:action op_2
       :parameters (?v8 - type_2 ?v4 - object ?v6 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v4 ?v1) (pred_1 ?v8 ?v6))
       :effect (and (pred_4 ?v4 ?v6)
		    (pred_2 ?v8 ?v1)
		    (not (pred_3 ?v8 ?v4 ?v1)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_11 obj_09 - type_2
obj_03 obj_02 obj_05 obj_10 - type_1
obj_04 obj_01 obj_08 - type_3
obj_06 obj_07 - object)
(:init
(pred_1 obj_11 obj_01)
(pred_2 obj_11 obj_03)
(pred_2 obj_11 obj_02)
(pred_1 obj_09 obj_01)
(pred_2 obj_09 obj_05)
(pred_2 obj_09 obj_10)
(pred_4 obj_06 obj_01)
(pred_4 obj_07 obj_08)
)
(:goal
(and
(pred_4 obj_06 obj_01)
(pred_4 obj_07 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_11 obj_08)))
)
)

; plan
1. (op_1 obj_09 obj_01 obj_08)
   deleted: (pred_1 obj_09 obj_01)
   added: (pred_1 obj_09 obj_08)
   goals met: 1 of 2
2. (op_3 obj_09 obj_07 obj_08 obj_10)
   deleted: (pred_4 obj_07 obj_08) (pred_2 obj_09 obj_10)
   added: (pred_3 obj_09 obj_07 obj_10)
   goals met: 1 of 2
3. (op_1 obj_09 obj_08 obj_01)
   deleted: (pred_1 obj_09 obj_08)
   added: (pred_1 obj_09 obj_01)
   goals met: 1 of 2
4. (op_2 obj_09 obj_07 obj_01 obj_10)
   deleted: (pred_3 obj_09 obj_07 obj_10)
   added: (pred_4 obj_07 obj_01) (pred_2 obj_09 obj_10)
   goals met: 2 of 2
